FineMesh/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-5 -5  0)	//0
    (0  -5  0)	//1
    (10  -5  0)	//2
    (-5  0  0)	//3
    (0   0  0)	//4
    (10   0  0)	//5
    (-5  5  0)	//6
    (0   5  0)	//7
    (10   5  0)	//8
    
    //opposite side
    
    (-5 -5  0.2)	//0
    (0  -5  0.2)	//1
    (10  -5  0.2)	//2
    (-5  0  0.2)	//3
    (0   0  0.2)	//4
    (10   0  0.2)	//5
    (-5  5  0.2)	//6
    (0   5  0.2)	//7
    (10   5  0.2)	//8

);

grad
{	
	x1		((0.84 0.6 0.125)(0.16 0.4 1));
	x2		((0.08 0.182 1)(0.92 0.818 5));
	
	y1		((0.16 0.4 1)(0.84 0.6 8));
	y2		((0.84 0.6 0.125)(0.16 0.4 1));
}

blocks
(
    hex (3 4 7 6 12 13 16 15) (100 100 1) simpleGrading ($grad.x1 $grad.y1 1)
    hex (4 5 8 7 13 14 17 16) (220 100 1) simpleGrading ($grad.x2 $grad.y1 1)
    hex (0 1 4 3 9 10 13 12) (100 100 1) simpleGrading ($grad.x1 $grad.y2 1)
    hex (1 2 5 4 10 11 14 13) (220 100 1) simpleGrading ($grad.x2 $grad.y2 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 12 9)
            (3 6 15 12)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (8 5 14 17)
            (5 2 11 14)
        );
    }

    top
    {
        type symmetryPlane;
        faces
        (
            (6 15 16 7)
            (7 16 17 8)
        );
    }

    bottom
    {
        type symmetryPlane;
        faces
        (

            (1 10 9 0)
            (2 11 10 1)
        );
    }
);


// ************************************************************************* //
