FineMesh/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         500;

deltaT          0.02;

writeControl    runTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    forceCoeffs
	{
		type forceCoeffs;
		libs ("libforces.so");
		porosity true;
		patches (porousBlockage);
		rhoName rho;
		rho rhoInf;
		rhoInf 1;
		log true;
		writeControl timeStep;
		writeInterval 1;
		liftDir (0 1 0);
		dragDir (1 0 0);
		CofR (0 0 0);
		pitchAxis (0 0 1);
		magUInf 0.5; // Set your free stream velocity
		lRef 1; // Set your reference length
		Aref 0.2; // Set your reference area
	}
	
	residuals
    {
        type            residuals;
        functionObjectLibs ("libutilityFunctionObjects.so");
        enabled         true;
		writeControl timeStep;
		writeInterval 1;

        fields
        (
            p
            U
        );
    }
}

// ************************************************************************* //
