FineMesh/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile 
{
    version     2.0;
    class       dictionary;
    object      decomposeParDict;
    format      ascii;
}
// ************************************************************************* //

numberOfSubdomains 6;

method          scotch;

simpleCoeffs
{
    n               (2 2 1);
    delta           0.001;
}

// ************************************************************************* //
